In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
sns.set()

In [2]:
titanic = pd.read_csv('data/titanic.csv')

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# biến output: biến Survived
# biến input: là các biến còn lại

In [5]:
# các biến có ý nghĩa phân tích gồm:
cols = ['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked','Survived']
titanic = titanic[cols]
titanic.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0       3    male  22.0      1      0   7.2500        S         0
1       1  female  38.0      1      0  71.2833        C         1
2       3  female  26.0      0      0   7.9250        S         1
3       1  female  35.0      1      0  53.1000        S         1
4       3    male  35.0      0      0   8.0500        S         0

In [6]:
# các biến object
cat_cols = titanic.select_dtypes(include='object').columns
cat_cols

Index(['Sex', 'Embarked'], dtype='object')

In [7]:
for col in cat_cols:
    print(col,'-',titanic[col].unique())

Sex - ['male' 'female']
Embarked - ['S' 'C' 'Q' nan]

In [8]:
# biến phân loại là: Sex, Embarked

In [9]:
# các biến number
num_cols = titanic.select_dtypes(include='number').columns
num_cols

Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Survived'], dtype='object')

In [12]:
for col in num_cols:
    if titanic[col].nunique()<=10:
        print(col, '-',titanic[col].unique())
    else:    
        print(col, '-',titanic[col].nunique())
# biến phân loại là: Pclass, Survived

Pclass - [3 1 2]
Age - 88
SibSp - [1 0 3 4 2 5 8]
Parch - [0 1 2 5 3 4 6]
Fare - 248
Survived - [0 1]

In [13]:
titanic.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0       3    male  22.0      1      0   7.2500        S         0
1       1  female  38.0      1      0  71.2833        C         1
2       3  female  26.0      0      0   7.9250        S         1
3       1  female  35.0      1      0  53.1000        S         1
4       3    male  35.0      0      0   8.0500        S         0

In [14]:
# các biến phân loại: Pclass, Sex, Embarked, Survived
# các biến số liên tục: Age, Fare
# các biến số rời rạc: SibSp, Parch

In [15]:
titanic.dtypes

Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Fare        float64
Embarked     object
Survived      int64
dtype: object

In [16]:
titanic['Pclass'] = titanic['Pclass'].astype('object')

In [17]:
titanic.describe(include='object')

        Pclass   Sex Embarked
count      891   891      889
unique       3     2        3
top          3  male        S
freq       491   577      644